_posts/2013-03-07-Another-approach-to-error-propagation.html
---
title: Another approach to error propagation
date: 2013/03/07 09:26:06
updated: 2013/04/23 21:28:24
categories: statistics
tags: 
---


<p>
In the previous section we examined an analytical approach to error propagation, and a simulation based approach. There is another approach to error propagation, using the uncertainties module (<a href="https://pypi.python.org/pypi/uncertainties/" >https://pypi.python.org/pypi/uncertainties/</a>). You have to install this package, e.g. <code>pip install uncertainties</code>. After that, the module provides new classes of numbers and functions that incorporate uncertainty and propagate the uncertainty through the functions. In the examples that follow, we repeat the calculations from the previous section using the uncertainties module. 
</p>

<p>
<span style="text-decoration:underline;">Addition and subtraction</span>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u

A = u.ufloat((2.5, 0.4))
B = u.ufloat((4.1, 0.3))
<span style="color: #8b0000;">print</span> A + B
<span style="color: #8b0000;">print</span> A - B
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 6.6+/-0.5
-1.6+/-0.5
</pre>

<p>
<span style="text-decoration:underline;">Multiplication and division</span>
</p>
<div class="org-src-container">

<pre class="src src-python">F = u.ufloat((25, 1))
x = u.ufloat((6.4, 0.4))

t = F * x
<span style="color: #8b0000;">print</span> t

d = F / x
<span style="color: #8b0000;">print</span> d
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 160.0+/-11.8726576637
&gt;&gt;&gt; &gt;&gt;&gt; 3.90625+/-0.289859806243
</pre>

<p>
<span style="text-decoration:underline;">Exponentiation</span>
</p>
<div class="org-src-container">

<pre class="src src-python">t = u.ufloat((2.03, 0.0203))
<span style="color: #8b0000;">print</span> t**5

<span style="color: #8b0000;">from</span> uncertainties.umath <span style="color: #8b0000;">import</span> sqrt
A = u.ufloat((16.07, 0.06))
<span style="color: #8b0000;">print</span> sqrt(A)
<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">print np.sqrt(A) # this does not work</span>

<span style="color: #8b0000;">from</span> uncertainties <span style="color: #8b0000;">import</span> unumpy <span style="color: #8b0000;">as</span> unp
<span style="color: #8b0000;">print</span> unp.sqrt(A)
</pre>
</div>

<pre class="example">
34.4730881243+/-1.72365440621
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 4.00874045057+/-0.00748364738749
... &gt;&gt;&gt; &gt;&gt;&gt; 4.00874045057+/-0.00748364738749
</pre>

<p>
Note in the last example, we had to either import a function from uncertainties.umath or import a special version of numpy that handles uncertainty. This may be a limitation of teh uncertainties package as not all functions in arbitrary modules can be covered. Note, however, that you can wrap a function to make it handle uncertainty like this.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np

wrapped_sqrt = u.wrap(np.sqrt)
<span style="color: #8b0000;">print</span> wrapped_sqrt(A)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; 4.00874045057+/-0.00748364738774
</pre>

<p>
<span style="text-decoration:underline;">Propagation of errors in an integral</span>
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u

x = np.array([u.ufloat((1, 0.01)), 
              u.ufloat((2, 0.1)),
              u.ufloat((3, 0.1))])

y = 2 * x

<span style="color: #8b0000;">print</span> np.trapz(x, y)
</pre>
</div>
<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; ... ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 8.0+/-0.600333240792
</pre>

<p>
<span style="text-decoration:underline;">Chain rule in error propagation</span>
</p>
<div class="org-src-container">

<pre class="src src-python">v0 = u.ufloat((1.2, 0.02))
a = u.ufloat((3.0, 0.3))
t = u.ufloat((12.0, 0.12))

v = v0 + a * t
<span style="color: #8b0000;">print</span> v
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; 37.2+/-3.61801050303
</pre>

<p>
<span style="text-decoration:underline;">A real example?</span>
This is what I would setup for a real working example. We try to compute the exit concentration from a CSTR. The idea is to wrap the &ldquo;external&rdquo; fsolve function using the <code>uncertainties.wrap</code> function, which handles the units. Unfortunately, it does not work, and it is not clear why. But see the following discussion for a fix. 
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve

Fa0 = u.ufloat((5.0, 0.05))
v0 = u.ufloat((10., 0.1))

V = u.ufloat((66000.0, 100))  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">reactor volume L^3</span>
k = u.ufloat((3.0, 0.2))      <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">rate constant L/mol/h</span>

<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(Ca):
    <span style="color: #228b22;">"Mole balance for a CSTR. Solve this equation for func(Ca)=0"</span>
    Fa = v0 * Ca     <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">exit molar flow of A</span>
    ra = -k * Ca**2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">rate of reaction of A L/mol/h</span>
    <span style="color: #8b0000;">return</span> Fa0 - Fa + V * ra

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">CA guess that that 90 % is reacted away</span>
CA_guess = 0.1 * Fa0 / v0

wrapped_fsolve = u.wrap(fsolve)
CA_sol = wrapped_fsolve(func, CA_guess)

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'The exit concentration is {0} mol/L'</span>.format(CA_sol)
</pre>
</div>

<pre class="example">
&gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; ... ... ... ... ... &gt;&gt;&gt; ... &gt;&gt;&gt; &gt;&gt;&gt; &gt;&gt;&gt; &lt;function fsolve at 0x148f25f0&gt;
&gt;&gt;&gt; &gt;&gt;&gt; The exit concentration is NotImplemented mol/L
</pre>

<p>
I got a note from the author of the uncertainties package explaining the cryptic error above, and a solution for it. The error arises because fsolve does not know how to deal with uncertainties. The idea is to create a function that returns a float, when everything is given as a float. Then, we wrap the fsolve call, and finally wrap the wrapped fsolve call! 
</p>

<ul>
<li>Step 1. Write the function to solve with arguments for all unitted quantities. This function may be called with uncertainties, or with floats.
</li>

<li>Step 2. Wrap the call to fsolve in a function that takes all the parameters as arguments, and that returns the solution.
</li>

<li>Step 3. Use uncertainties.wrap to wrap the function in Step 2 to get the answer with uncertainties.
</li>
</ul>

<p>
Here is the code that does work:
</p>
<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> uncertainties <span style="color: #8b0000;">as</span> u
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve

Fa0 = u.ufloat((5.0, 0.05))
v0 = u.ufloat((10., 0.1))

V = u.ufloat((66000.0, 100.0))  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">reactor volume L^3</span>
k = u.ufloat((3.0, 0.2))      <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">rate constant L/mol/h</span>

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Step 1</span>
<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(Ca, v0, k, Fa0, V):
    <span style="color: #228b22;">"Mole balance for a CSTR. Solve this equation for func(Ca)=0"</span>
    Fa = v0 * Ca     <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">exit molar flow of A</span>
    ra = -k * Ca**2  <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">rate of reaction of A L/mol/h</span>
    <span style="color: #8b0000;">return</span> Fa0 - Fa + V * ra

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Step 2</span>
<span style="color: #8b0000;">def</span> <span style="color: #8b2323;">Ca_solve</span>(v0, k, Fa0, V): 
    <span style="color: #228b22;">'wrap fsolve to pass parameters as float or units'</span>
    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">this line is a little fragile. You must put [0] at the end or</span>
    <span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">you get the NotImplemented result</span>
    sol = fsolve(func, 0.1 * Fa0 / v0, args=(v0, k, Fa0, V))[0]
    <span style="color: #8b0000;">return</span> sol

<span style="color: #ff0000; font-weight: bold;"># </span><span style="color: #ff0000; font-weight: bold;">Step 3</span>
<span style="color: #8b0000;">print</span> u.wrap(Ca_solve)(v0, k, Fa0, V)
</pre>
</div>

<pre class="example">
0.005+/-0.000167764327667
</pre>

<p>
It would take some practice to get used to this, but the payoff is that you have an &ldquo;automatic&rdquo; error propagation method.
</p>

<p>
Being ever the skeptic, let us compare the result above to the Monte Carlo approach to error estimation below.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #8b0000;">import</span> numpy <span style="color: #8b0000;">as</span> np
<span style="color: #8b0000;">from</span> scipy.optimize <span style="color: #8b0000;">import</span> fsolve

N = 10000
Fa0 = np.random.normal(5, 0.05, (1, N))
v0 = np.random.normal(10.0, 0.1, (1, N))
V =  np.random.normal(66000, 100, (1,N))
k = np.random.normal(3.0, 0.2, (1, N))

SOL = np.zeros((1, N))

<span style="color: #8b0000;">for</span> i <span style="color: #8b0000;">in</span> <span style="color: #8b0000;">range</span>(N):
    <span style="color: #8b0000;">def</span> <span style="color: #8b2323;">func</span>(Ca):
        <span style="color: #8b0000;">return</span> Fa0[0,i] - v0[0,i] * Ca + V[0,i] * (-k[0,i] * Ca**2)
    SOL[0,i] = fsolve(func, 0.1 * Fa0[0,i] / v0[0,i])[0]

<span style="color: #8b0000;">print</span> <span style="color: #228b22;">'Ca(exit) = {0}+/-{1}'</span>.format(np.mean(SOL), np.std(SOL))
</pre>
</div>

<pre class="example">
Ca(exit) = 0.00500829453185+/-0.000169103578901
</pre>

<p>
I am pretty content those are the same!
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
The uncertainties module is pretty amazing. It automatically propagates errors through a pretty broad range of computations. It is a little tricky for third-party packages, but it seems doable.
</p>

<p>
Read more about the package at <a href="http://pythonhosted.org/uncertainties/index.html" >http://pythonhosted.org/uncertainties/index.html</a>.
</p>
</div>
</div>
<p>Copyright (C) 2013 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2013/03/07/Another-approach-to-error-propagation.org">org-mode source</a><p>